#### 데이터 프레임 연산

In [1]:
# 테스트 libary
import pandas as pd
import numpy as np

In [32]:
# 테스트 데이터
data = {'eng' :[10,30,50,70],
        'kor' :[20,40,60,80],
        'math':[90,50,20,70]}
df = pd.DataFrame(data, index=['a','b','c','d'])
display(df)

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [15]:
display(df + 2) # 더하기

   eng  kor  math
a    5   22    92
b    6   42    52
c    7   62    22
d    8   82    72

In [16]:
display(df - 2) # 빼기

   eng  kor  math
a    1   18    88
b    2   38    48
c    3   58    18
d    4   78    68

In [17]:
display(df * 2) # 곱하기

   eng  kor  math
a    6   40   180
b    8   80   100
c   10  120    40
d   12  160   140

In [14]:
display(df / 2) # 나누기

   eng   kor  math
a  1.5  10.0  45.0
b  2.0  20.0  25.0
c  2.5  30.0  10.0
d  3.0  40.0  35.0

In [18]:
df.eng = 2
display(df)

   eng  kor  math
a    2   20    90
b    2   40    50
c    2   60    20
d    2   80    70

In [19]:
df['eng'] = [1,2,3,4]
display(df)

   eng  kor  math
a    1   20    90
b    2   40    50
c    3   60    20
d    4   80    70

In [20]:
df['eng'] = df['eng'] + 2
display(df)

   eng  kor  math
a    3   20    90
b    4   40    50
c    5   60    20
d    6   80    70

In [27]:
df.loc['b'] = [20,30,50]
display(df.loc[['b']])

   eng  kor  math
b   20   30    50

In [29]:
df.loc['c':,'kor':] = [[1,2],[3,4]]
df

   eng  kor  math
a    3   20    90
b   20   30    50
c    5    1     2
d    6    3     4

In [30]:
df.loc['c':,'kor':] = df.loc['c':,'kor':] + 2
df

   eng  kor  math
a    3   20    90
b   20   30    50
c    5    3     4
d    6    5     6

In [37]:
df[ [False, False, True, False] ] # 행단위 boolean indexing

   eng  kor  math
c   50   60    20

In [36]:
df[ df['eng'] > 60 ] # boolean indexing

   eng  kor  math
d   70   80    70

In [56]:
n = 30
display(df.query( f'eng > {n}' )) # 'eng > 30'

s = f'n={n}'
s

   eng  kor  math
c   50   60    20
d   70   80    70

'n=30'

In [53]:
# 관계 연산자 우선순위 때문에 반드시 조건에 () 로 묶어줘야 한다.
display( df.query( '40 <= kor < 60' )  )
display( df.query( 'eng < 20 and eng < 70')  )
df[ (df.eng==70) | (df.kor == 80) | (df.math == 80) ]

   eng  kor  math
b   30   40    50

   eng  kor  math
a   10   20    90

   eng  kor  math
d   70   80    70

In [42]:
# df[ df.eng > 30 ]
df.query('eng > 50')

   eng  kor  math
d   70   80    70